app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings"
---
  def index
    @listings = Listing.all

INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test Listing"], ["description", "This is just a test"], ["price", 1.0], ["created_at", "2015-06-26 08:55:33.120265"], ["updated_at", "2015-06-26 08:55:33.120265"]]
---
  def create
    @listing = Listing.new(listing_params)
    @listing.userid = current_user.id

    respond_to do |format|
      if @listing.save

UPDATE "listings" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["image_updated_at", "2015-06-27 06:34:07.711174"], ["image_file_name", "couple_pillows.png"], ["updated_at", "2015-06-27 06:34:08.978342"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @listing.update(listing_params)

DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 1]]
---
  def destroy
    @listing.destroy

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_listing
      @listing = Listing.find(params[:id])